backend/views/post/_form.php

            ])->label(Yii::t('yii', 'Content', null, $language));?>
        </div>
        <?php $j++; } ?>
    <?= $form->field($model, 'category_id')->dropDownList(ArrayHelper::map(Category::find()->all(), 'id', 'name')) ?>
---
SELECT * FROM `category`